Тест1/src/Documents/Рас_Комплектовка/Рас_Комплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рас_Комплектовка</name>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеКомплектовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </attributes>
  <attributes>
    <name>Полная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальПродана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСписок</name>
    <attributes>
      <name>Номенклатураспис</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаботыСписок</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.АвтоРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусРаботы</name>
      <type>
        <types>EnumRef.СостояниеВосстановленияДетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Нормочас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполненияРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/InformationRegisters/Комментарии/Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Комментарии</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/Documents/Рас_Комплектовка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РегистрНакопления1 Приход
	Движения.РегистрНакопления1.Записывать = Истина;
	
	Если Направление Тогда
		Для Каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад  = ТекСтрокаНоменклатураСписок.Склад;
			Движение.Товар  = ТекСтрокаНоменклатураСписок.Номенклатураспис;
			Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
			Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
			Движение.Колво  = ТекСтрокаНоменклатураСписок.Количество; 
			
			об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
			об.индкод = ТекСтрокаНоменклатураСписок.Партия;
			об.Прочитать();	
			Если Не об.Выбран() И Не ПустаяСтрока(ТекСтрокаНоменклатураСписок.Партия)  Тогда
				
				об.Код = ТекСтрокаНоменклатураСписок.Партия;
				об.индкод = ТекСтрокаНоменклатураСписок.Партия; 
				
				об.Записать();
			КонецЕсли;
			
		КонецЦикла;
		//Если Полная Тогда
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Товар = Номенклатура;
			Движение.машина = Машина;
			Движение.индкод = Инкод;
			Движение.Колво = 1;
		//КонецЕсли;
	Иначе
		// регистр РегистрНакопления1 Расход
		///+ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
		//Если Состояние = Перечисления.СостояниеКомплектовки.ВРаботе ИЛИ 
		//	Состояние = Перечисления.СостояниеКомплектовки.Выполнено Тогда
		//	
		//	Движение = Движения.РегистрНакопления1.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период = Дата;
		//	Движение.Склад = Справочники.Склады.НайтиПоКоду("000000017");
		//	Движение.Товар = Номенклатура;
		//	Движение.машина = Машина;
		//	Движение.индкод = Инкод;
		//	Движение.Колво = 1; 
		//	
		//		об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
		//	об.индкод =Инкод;
		//	об.Прочитать();	
		//	Если Не об.Выбран() И Не ПустаяСтрока(Инкод)  Тогда
		
		//	об.Код = Инкод;
		//	об.индкод = Инкод;
		//	об.Записать();
		//	КонецЕсли;
		
		//	Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
		//		Движение = Движения.РегистрНакопления1.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		Движение.Период = Дата;
		//		Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
		//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
		//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
		//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
		//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		//	КонецЦикла; 
		//	Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
		//		Движение = Движения.РегистрНакопления1.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//		Движение.Период = Дата;
		//		Движение.Склад = Справочники.Склады.НайтиПоКоду("000000017");
		//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
		//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
		//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
		//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		//	КонецЦикла; 
		//ИначеЕсли Состояние = Перечисления.СостояниеКомплектовки.Разнесено Тогда
		Движение = Движения.РегистрНакопления1.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Номенклатура;
		Движение.машина = Машина;
		Движение.индкод = Инкод;
		Движение.Колво = 1;  
		
		об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
		об.индкод =Инкод;
		об.Прочитать();	
		Если Не об.Выбран() И Не ПустаяСтрока(Инкод)  Тогда
			
			об.Код = Инкод;
			об.индкод = Инкод; 
			об.Состояние = Перечисления.Состояние.Восстановленная;  
			//об.Стеллаж = Перечисления.Состояние.Восстановленная;
			об.Записать();
		КонецЕсли;
		
		Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
			Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
			Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
			Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
			Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		КонецЦикла;
	КонецЕсли;
	//КонецЕсли;
	///-ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	//	
	//	Для Каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
	//		Движение = Движения.РегистрНакопления1.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
	//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
	//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
	//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
	//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
	//	КонецЦикла;
	//	Движение = Движения.РегистрНакопления1.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Склад = Склад;
	//	Движение.Товар = Номенклатура;
	//	Движение.машина = Машина;
	//	Движение.индкод = Инкод;
	//	Движение.Колво = 1;
	//КонецЕсли;
	
	Движения.Записать();
	
	Отказ = РегистрыНакопления.РегистрНакопления1.ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад);
	
	///+ГомзМА 23.03.2023
	ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.Машина  = Машина;
	ЗаписьВРегистреСведений.Товар 	= Номенклатура;
	ЗаписьВРегистреСведений.индкод 	= Инкод;
	ЗаписьВРегистреСведений.Прочитать();
	
	Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(Комментарий)) Тогда
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Машина 		= Машина;
		ЗаписьВРегистреСведений.Товар 		= Номенклатура;
		ЗаписьВРегистреСведений.индкод 		= Инкод;
		
		ЗаписьВРегистреСведений.Записать();
	Иначе
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Записать(Истина);
	КонецЕсли;
	
	// Получим таблицу партий
	ТаблицаТовары = НоменклатураСписок.Выгрузить();
	
	Для Каждого ТекСтрокаТаблица Из ТаблицаТовары Цикл
		индкод = ТекСтрокаТаблица.Партия;
		ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
		ЗаписьВРегистреСведений.Машина  = ТекСтрокаТаблица.Автомобиль;
		ЗаписьВРегистреСведений.Товар 	= ТекСтрокаТаблица.Номенклатураспис;
		ЗаписьВРегистреСведений.индкод  = индкод;
		ЗаписьВРегистреСведений.Прочитать();
		Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(ТекСтрокаТаблица.Комментарий)) Тогда
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Машина 		= ТекСтрокаТаблица.Автомобиль;
			ЗаписьВРегистреСведений.Товар 		= ТекСтрокаТаблица.Номенклатураспис;
			ЗаписьВРегистреСведений.индкод 		= индкод;
			
			ЗаписьВРегистреСведений.Записать();
		Иначе
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 23.03.2023
	
КонецПроцедуры
